<?php

$changbanpo = [
    'welcomeToScript' => '欢迎进入情景游戏血战长坂坡. 您将扮演长坂坡之战的赵云将军, 通过您的选择拯救尚在襁褓中的后主阿斗. ',

    'menu' => '请您选择菜单功能, 说"章节"可以选择游戏章节, 说"简介"可以听取游戏简介, 说"结局"可查看已解锁结局. 说"返回"会退出菜单. 游戏中说"菜单"可以随时打开菜单',

    'chooseEpisode' => '您可以说出章节名称选择要游戏的章节. 已解锁章节有: {suggestionStr}',

    'searchGan' => '第一章, 寻找甘夫人',

    'imZhaoYun' => '您现在扮演的是赵云将军. 曹操南征荆州, 主公刘备刘玄德率领荆州十数万平民前往江陵, 您奉命帅部保卫主公的家眷.',

    'fightWholeNight' => '不料在长坂一带被曹操精锐部队虎豹骑追上, 我军大败.您从半夜和曹军厮杀, 来往冲突, 一直战斗到天亮. 既找不到主公刘备, 又和刘备家眷在乱军中失散. ',

    'ifGoFindGan' => '您既担心看护的家眷下落, 又担心主公刘备的安危, 该怎么办呢? 请决定是否出发寻找家眷? ',


    'endDieRegrat' => '您觉得还是主公刘备性命要紧, 血战杀出重围, 在长板桥后二十里的大树下找到了被众人保护逃脱的玄德主公. 虽然事后得知, 甘夫人, 糜夫人和阿斗都命丧乱军之手; 但主公玄德对您一如既往, 从未提起过您的失职. 不过内心的悔恨常年盘旋在您心头, 在多年随刘备攻占益州之后, 您在一场大病中含恨离开了人世. ',

    'unlockEnding' => '获得结局, "{ending}". ',

    'endEpisode' => '本章结束. ',

    'badEnding' => '似乎结局不够完美, 您想再试一次吗?',

    'startSearchGan' => '您心中思考, 主公将甘夫人, 糜夫人和少主阿斗托付给我, 今日军中失散, 有何面目再去见刘将军? 不如决一死战, 豁出性命, 也要找到二位夫人与阿斗的下落. ',

    'meetCivilians' => '您于是率领三十位骑士杀回了战场. 周围到处都是逃亡中的荆州百姓, 嚎哭声震天动地. 前面草坡上就有几个被遗弃的重伤员在呻吟着. 不过战情紧迫, 似乎也没时间顾及他们.',

    'shouldHelpCivilians' => '您是否想看一眼这些重伤者?',

    'missJianYong' => '时间如此紧迫, 到处都是伤患, 哪能顾得了每一个人? 您赶紧率队往战场长坂坡前进. ',

    'meetSoldier' => '人马走到一处, 突然一人大叫: "赵将军哪里去?" 您转头一看, 原来是名护送刘备家人车杖的士兵, 中箭倒在地上, 血流满地. ',

    'toldAboutGan' => '您赶忙去问二位夫人的消息. 中箭士兵说道: "刚才看到甘夫人披着头发, 鞋子也掉了, 跟随一群百姓妇女, 往南边逃走了. 赵将军快去找她们吧". ',

    'meetThreeCrowds' => '您赶紧率队往南追去, 果然在前方看到三个方向都有人群. 一群是男女百姓在逃命, 一群是我方失去将领的败兵在流窜, 而不远处看得到刘备的亲卫队战士在与追兵交战.',

    'searchWhichCrowd' => '您决定要去哪一边寻找甘夫人, 是百姓, 残兵, 还是战士呢?',

    'searchRunners' => '您冲到逃跑的残兵中间, 喝止住了溃逃. 简短地整编了队伍, 多了将近一百名战力. 您率领他们重新杀回长坂坡战场.',

    'notFoundGan' => '追兵越来越多, 血战了半日, 您再也没有得到甘夫人和糜夫人的消息. 身边的战士一个个阵亡, 您也精疲力竭. 最终倒在了长坂坡敌军的枪林之中, 用生命履行了自己的誓言. ',

    'meetJianYong' => '您虽然心中知道无法救助所有人, 但也多看了这些伤员几眼. 没想到您看见其中一人, 正是主公的重要心腹谋士简雍. 您急忙问他二位夫人的下落. 简雍说: "两位夫人丢下了车杖, 抱着阿斗徒步往那边逃走. 我策马追过去, 不料被一名敌将刺了一枪, 夺走了我的战马, 眼看倒在这里等死." ',

    'shouldHelpJianYong' => '您扶起简雍, 决定将他送离战场. 然而一方面简雍伤势不轻; 另一方面局势紧迫, 人力和马匹都很紧缺. 该怎么办呢? 请选择 {suggestionStr}',

    'helpNotice' => '没有明白您的意思. 您可以说"{repeat}"重复问题, 说"{menu}"打开菜单, 说"{fallback}"以退出.',

    'sendSoldierWithJian' => '您在随从中借了一匹马, 又命令二人护送简雍南走. 要简雍为您带去口信, "我赵云上天入地, 好歹要找到二位夫人与少主, 若找不到, 战死沙场而已!" ',

    'giveJianHorse' => '您在随从中借了一匹马给简雍, 要简雍为您带去口信, "我赵云上天入地, 好歹要找到二位夫人与少主, 若找不到, 战死沙场而已!"',

    'takeCareJian' => '您担心简雍负伤, 周围就是战场, 遇到追兵或流寇他也走不远. 于是决定亲自护送一程. 眼看简雍逃出战场之后, 您赶紧率队伍赶回了战场. ',

    'meetDiedSoldier' => '这时敌军已经杀了过来, 您一边拼杀, 一边寻找. 遇到了一位护送刘备家人车杖的士兵, 赶紧抱起来追问, 可他奄奄一息, 还没说出话来就已经断气了. ',

    'searchFighters' => '您带队冲向了战士们, 帮他们杀退了追兵. 人马加在一起又多了几十人. 可他们光顾作战, 已经无从得知两位夫人的下落了. ',

    'foundGan' => '您顾不得战事, 赶紧追上百姓, 大叫"甘夫人在否?". 只听得人群中一人放声大哭, 正是甘夫人. 您下马, 插枪, 流着泪说:"让夫人失散, 云之罪也! 糜夫人与少主安在?" ',

    'toldMi' => '甘夫人抹掉眼泪说, "我与糜夫人被曹军追赶上, 丢下了车杖, 和百姓一起步行逃走, 又被一伙敌兵冲散, 糜夫人与阿斗不知去了哪里, 我独自逃生到此." 正说话间, 杀声震天, 远处一伙敌兵冲了过来. 欲知后事如何, 请听下回分解. ',

    'unlockEpisode' => '解锁新章节: {episode}.',

    'startNewEpisode' => '请问要开始新章节吗?',

    'choiceNotExists' => '没能明白您的意思. 请选择 {choices}',

    'needConfirmation' => '没能明白您的意思. 可以试着说"是的", 或者"不要"',

];

$data = [];
$data['storyComponent']['sanguo']['changbanpo'] = $changbanpo;

return $data;
